Revit 2027 API
Point.Create(XYZ, ElementId) Method
 Creates a point at the given coordinates and assigns it the specified GraphicsStyle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Point Create(
	XYZ coord,
	ElementId id
)
Public Shared Function Create (
	coord As XYZ,
	id As ElementId
) As Point
public:
static Point^ Create(
	XYZ^ coord,
	ElementId^ id
)
static member Create :
        coord : XYZ *
        id : ElementId -> Point
Parameters
coord XYZ
 The coordinates where the point will be created.
id ElementId
 The id of the GraphicsStyle element from which to apply the point properties.
Return Value
Point
 A Point object.
See Also
Reference
Point Class
Create Overload
Autodesk.Revit.DB Namespace